//------------------------------------------------------------------------------
// This is Open source software. You can place this code on your site, but don't
// forget a link to my YouTube-channel: https://www.youtube.com/channel/UChButpZaL5kUUl_zTyIDFkQ
// РЃС‚Рѕ РїСЂРѕРіСЂР°РјРјРЅРѕРµ РѕР±РµСЃРїРµС‡РµРЅРёРµ СЂР°СЃРїСЂРѕСЃС‚СЂР°РЅв‚¬РµС‚СЃв‚¬ СЃРІРѕР±РѕРґРЅРѕ. В¬С‹ РјРѕР¶РµС‚Рµ СЂР°Р·РјРµС‰Р°С‚СЊ
// РµРіРѕ РЅР° РІР°С€РµРј СЃР°Р№С‚Рµ, РЅРѕ РЅРµ Р·Р°Р±СѓРґСЊС‚Рµ СѓРєР°Р·Р°С‚СЊ СЃСЃС‹Р»РєСѓ РЅР° РјРѕР№ YouTube-РєР°РЅР°Р»
// "РЃР»РµРєС‚СЂРѕРЅРёРєР° РІ РѕР±СЉРµРєС‚РёРєРµ" https://www.youtube.com/channel/UChButpZaL5kUUl_zTyIDFkQ
// С�РІС‚РѕСЂ: РЊР°РґС‹СЂС€РёРЅ вЂ“СѓСЃР»Р°РЅ / Nadyrshin Ruslan
//------------------------------------------------------------------------------
#ifndef _SSD1306_H
#define _SSD1306_H

#include <types.h>

#define SSD1306_IfMode_Par8080                  0       // С•Р°СЂР°Р»Р»РµР»СЊРЅС‹Р№ РёРЅС‚РµСЂС„РµР№СЃ 8080 8-Р±РёС‚
#define SSD1306_IfMode_Par6800                  1       // С•Р°СЂР°Р»Р»РµР»СЊРЅС‹Р№ РёРЅС‚РµСЂС„РµР№СЃ 6800 8-Р±РёС‚
#define SSD1306_IfMode_SPI_3w                   2       // SPI РїРѕ 3 Р»РёРЅРёв‚¬Рј (CS, SCLK, MOSI)
#define SSD1306_IfMode_SPI_4w                   3       // SPI РїРѕ 4 Р»РёРЅРёв‚¬Рј (CS, SCLK, MOSI, D/C)
#define SSD1306_IfMode_I2C                      4       // I2C

// В»РЅС‚РµСЂС„РµР№СЃ РїРѕРґРєР»СЋС‡РµРЅРёв‚¬ РґРёСЃРїР»Рµв‚¬
#define SSD1306_IfMode          SSD1306_IfMode_SPI_4w //SSD1306_IfMode_I2C


// вЂ“РµР¶РёРјС‹ Р°РІС‚РѕРјР°С‚РёС‡РµСЃРєРѕРіРѕ СЃРґРІРёРіР° СѓРєР°Р·Р°С‚РµР»в‚¬ РІ РїР°Рјв‚¬С‚Рё РєР°РґСЂР° ssd1306
#define SSD1306_Adressing_Horizontal            0       // вЂ”РЅР°С‡Р°Р»Р° РёРЅРєСЂРµРјРµРЅС‚ РїРѕ РіРѕСЂРёР·РѕРЅС‚Р°Р»Рё, Р·Р°С‚РµРј РёРЅРєСЂРµРјРµРЅС‚ РїРѕ РІРµСЂС‚РёРєР°Р»Рё
#define SSD1306_Adressing_Vertical              1       // вЂ”РЅР°С‡Р°Р»Р° РёРЅРєСЂРµРјРµРЅС‚ РїРѕ РІРµСЂС‚РёРєР°Р»Рё, Р·Р°С‚РµРј РёРЅРєСЂРµРјРµРЅС‚ РїРѕ РіРѕСЂРёР·РѕРЅС‚Р°Р»Рё
#define SSD1306_Adressing_Page                  2       // В»РЅРєСЂРµРјРµРЅС‚ С‚РѕР»СЊРєРѕ РїРѕ РіРѕСЂРёР·РѕРЅС‚Р°Р»Рё


//==============================================================================
//  РѕРґС‹ РєРѕРјР°РЅРґ РґРёСЃРїР»Рµв‚¬
//==============================================================================
//  РѕРјР°РЅРґС‹ РёР· СЂР°Р·РґРµР»Р° Fundamental
#define SSD1306_CMD_SetContrast                 0x81
#define SSD1306_CMD_AllPixRAM                   0xA4
#define SSD1306_CMD_AllPixOn                    0xA5
#define SSD1306_CMD_SetInverseOff               0xA6
#define SSD1306_CMD_SetInverseOn                0xA7
#define SSD1306_CMD_Sleep                       0xAE
#define SSD1306_CMD_Wake                        0xAF

//  РѕРјР°РЅРґС‹ РёР· СЂР°Р·РґРµР»Р° Scrolling
#define SSD1306_CMD_DeactivateScroll            0x2E

//  РѕРјР°РЅРґС‹ РёР· СЂР°Р·РґРµР»Р° Addressing Setting
//  РѕРјР°РЅРґР° РІС‹Р±РѕСЂР° СЂРµР¶РёРјР° Р°РІС‚РѕСЃРґРІРёРіР° СѓРєР°Р·Р°С‚РµР»в‚¬ РІ РїР°Рјв‚¬С‚Рё РєР°РґСЂР°
#define SSD1306_CMD_SetMemAdressingMode         0x20    
//  РѕРјР°РЅРґС‹ РІС‹Р±РѕСЂР° РґРёР°РїР°Р·РѕРЅР° РёР·РјРµРЅРµРЅРёв‚¬ СЃС‚СЂР°РЅРёС†С‹ Рё РєРѕР»РѕРЅРєРё РїСЂРё Р°РІС‚РѕСЃРґРІРёРіРµ СѓРєР°Р·Р°С‚РµР»в‚¬ РІ РїР°Рјв‚¬С‚Рё РєР°РґСЂР°
// С•СЂРёРјРµРЅв‚¬РµС‚СЃв‚¬ РґР»в‚¬ СЂРµР¶РёРјРѕРІ Р°РІС‚РѕСЃРґРІРёРіР° SSD1306_Adressing_Horizontal Рё SSD1306_Adressing_Vertical
#define SSD1306_CMD_SetColumnAddr               0x21
#define SSD1306_CMD_SetPageAddr                 0x22
//  РѕРјР°РЅРґС‹ РІС‹Р±РѕСЂР° СЃС‚СЂР°РЅРёС†С‹ Рё РґРёР°РїР°Р·РѕРЅР° РёР·РјРµРЅРµРЅРёв‚¬ РєРѕР»РѕРЅРєРё РїСЂРё Р°РІС‚РѕСЃРґРІРёРіРµ СѓРєР°Р·Р°С‚РµР»в‚¬ РІ РїР°Рјв‚¬С‚Рё РєР°РґСЂР°
// С•СЂРёРјРµРЅв‚¬РµС‚СЃв‚¬ РґР»в‚¬ СЂРµР¶РёРјР° Р°РІС‚РѕСЃРґРІРёРіР° SSD1306_Adressing_Page
#define SSD1306_CMD_PageAddrMode_SetPage        0xB0
#define SSD1306_CMD_PageAddrMode_StartColumnLo  0x00
#define SSD1306_CMD_PageAddrMode_StartColumnHi  0x10

//  РѕРјР°РЅРґС‹ РёР· СЂР°Р·РґРµР»Р° Hardware Configuration
#define SSD1306_CMD_SetDisplayStartLine         0x40
#define SSD1306_CMD_SetSegmentRemap             0xA0
#define SSD1306_CMD_SetMultiplexRatio           0xA8
#define SSD1306_CMD_SetCOMoutScanDirection      0xC0 
#define SSD1306_CMD_SetDisplayOffset            0xD3
#define SSD1306_CMD_SetCOMPinsConfig            0xDA
  
//  РѕРјР°РЅРґС‹ РёР· СЂР°Р·РґРµР»Р° Timing & Driving Scheme Setting
#define SSD1306_CMD_SetDisplayClockDivider      0xD5
#define SSD1306_CMD_SetPrechargePeriod          0xD9
#define SSD1306_CMD_SetVCOMHDeselectLevel       0xDB

//  РѕРјР°РЅРґС‹ РёР· СЂР°Р·РґРµР»Р° Charge Pump
#define SSD1306_CMD_ChargePumpSetting           0x8D
//==============================================================================


//==============================================================================
// РЊР°СЃС‚СЂРѕР№РєРё РїРѕРґРєР»СЋС‡РµРЅРёв‚¬ Рє РґРёСЃРїР»РµСЋ
//==============================================================================
#define SSD1306_ResetPinUsed          1       // В»СЃРїРѕР»СЊР·СѓРµС‚СЃв‚¬ СѓРїСЂР°РІР»РµРЅРёРµ РїРёРЅРѕРј Reset ssd1306
#define SSD1306_Reset_Port            GPIOA
#define SSD1306_Reset_Pin             GPIO_Pin_12

#if (SSD1306_IfMode == SSD1306_IfMode_I2C)       // С•Р°СЂР°РјРµС‚СЂС‹ СЂР°Р±РѕС‚С‹ РїРѕ I2C
  // i2c-Р°РґСЂРµСЃ РєРѕРЅС‚СЂРѕР»Р»РµСЂР° РґРёСЃРїР»Рµв‚¬. В«Р°РІРёСЃРёС‚ РѕС‚ СЃРѕСЃС‚Рѕв‚¬РЅРёв‚¬ РЅРѕР¶РєРё SA0 (РѕРЅР° Р¶Рµ D/C). 0x3C РёР»Рё 0x3D
  #define SSD1306_I2C_addr              0x3C //0x3D;   // 7-Р±РёС‚РЅС‹Р№ i2c-Р°РґСЂРµСЃ РєРѕРЅС‚СЂРѕР»Р»РµСЂР° РґРёСЃРїР»Рµв‚¬ ssd1306
  #define SSD1306_I2C_periph            I2C1    // I2C1 РёР»Рё I2C2
  #define SSD1306_I2C_clock             100000  // вЂћР°СЃС‚РѕС‚Р° СЂР°Р±РѕС‚С‹ I2C
  #define SSD1306_I2C_timeout           1000 //1000    // вЂњР°Р№РјР°СѓС‚ РѕР¶РёРґР°РЅРёв‚¬ РІС‹РїРѕР»РЅРµРЅРёв‚¬ РѕРїРµСЂР°С†РёР№ РЅР° i2c
#elif (SSD1306_IfMode == SSD1306_IfMode_SPI_4w)       // С•Р°СЂР°РјРµС‚СЂС‹ СЂР°Р±РѕС‚С‹ РїРѕ SPI-4w
  #define SSD1306_SPI_periph            SPI1    // SPI1 РёР»Рё SPI2
  #define SSD1306_CSPinUsed             0       // В»СЃРїРѕР»СЊР·СѓРµС‚СЃв‚¬ СѓРїСЂР°РІР»РµРЅРёРµ РїРёРЅРѕРј CS ssd1306
  #define SSD1306_CS_Port               GPIOA
  #define SSD1306_CS_Pin                GPIO_Pin_4
  #define SSD1306_DC_Port               GPIOA
  #define SSD1306_DC_Pin                GPIO_Pin_1
#elif (SSD1306_IfMode == SSD1306_IfMode_SPI_3w)       // С•Р°СЂР°РјРµС‚СЂС‹ СЂР°Р±РѕС‚С‹ РїРѕ SPI-3w
  #error вЂ“Р°Р±РѕС‚Р° РїРѕ РІС‹Р±СЂР°РЅРЅРѕРјСѓ РёРЅС‚РµСЂС„РµР№СЃСѓ РЅРµ РїРѕРґРґРµСЂР¶РёРІР°РµС‚СЃв‚¬. С�РїРїР°СЂР°С‚РЅС‹Р№ SPI РЅРµ СЂР°Р±РѕС‚Р°РµС‚ РІ 9-Р±РёС‚РЅРѕРј СЂРµР¶РёРјРµ
#else
  #error вЂ“Р°Р±РѕС‚Р° РїРѕ РІС‹Р±СЂР°РЅРЅРѕРјСѓ РёРЅС‚РµСЂС„РµР№СЃСѓ РµС‰Р„ РЅРµ СЂРµР°Р»РёР·РѕРІР°РЅР° (СЃРј. РєРѕРЅСЃС‚Р°РЅС‚Сѓ SSD1306_IfMode)
#endif
//==============================================================================


// С•СЂРѕС†РµРґСѓСЂР° РёРЅРёС†РёР°Р»РёР·Р°С†РёРё РґРёСЃРїР»Рµв‚¬ РЅР° РєРѕРЅС‚СЂРѕР»Р»РµСЂРµ ssd1306
void SSD1306_Init(uint8_t Width, uint8_t Height);
// С•СЂРѕС†РµРґСѓСЂР° РїРµСЂРµРІРѕРґРёС‚ РґРёСЃРїР»РµР№ РІ СЂРµР¶РёРј СЃРЅР°
void SSD1306_Sleep(void);
// С•СЂРѕС†РµРґСѓСЂР° РІС‹РІРѕРґРёС‚ РґРёСЃРїР»РµР№ РёР· СЂРµР¶РёРјР° СЃРЅР°
void SSD1306_Wake(void);
// С•СЂРѕС†РµРґСѓСЂР° РІРєР»СЋС‡Р°РµС‚ РёРЅРІРµСЂСЃРёСЋ РґРёСЃРїР»Рµв‚¬
void SSD1306_SetInverseOn(void);
// С•СЂРѕС†РµРґСѓСЂР° РѕС‚РєР»СЋС‡Р°РµС‚ РёРЅРІРµСЂСЃРёСЋ РґРёСЃРїР»Рµв‚¬
void SSD1306_SetInverseOff(void);
// С•СЂРѕС†РµРґСѓСЂР° РІРєР»СЋС‡Р°РµС‚ РІСЃРµ РїРёРєСЃРµР»Рё РґРёСЃРїР»Рµв‚¬ (вЂњРµСЃС‚ РёРЅРґРёРєР°С‚РѕСЂР°)
void SSD1306_AllPixOn(void);
// С•СЂРѕС†РµРґСѓСЂР° РѕС‚РєР»СЋС‡Р°РµС‚ С‚РµСЃС‚ РґРёСЃРїР»Рµв‚¬ Рё РІС‹РІРѕРґРёС‚ РЅР° РЅРµРіРѕ РєР°СЂС‚РёРЅРєСѓ РёР· Р±СѓС„РµСЂР° РєР°РґСЂР° РІ ssd1306
void SSD1306_AllPixRAM(void);
// С•СЂРѕС†РµРґСѓСЂР° СѓСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ РїР°СЂР°РјРµС‚СЂ РєРѕРЅС‚СЂР°СЃС‚РЅРѕСЃС‚Рё (0-255)
void SSD1306_SetContrast(uint8_t Value);
// С•СЂРѕС†РµРґСѓСЂР° СѓСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ РЅР°С‡Р°Р»СЊРЅС‹Р№ Рё РєРѕРЅРµС‡РЅС‹Р№ РёРЅРґРµРєСЃ РєРѕР»РѕРЅРєРё
// РґР»в‚¬ Р°РІС‚РѕСЃРјРµС‰РµРЅРёв‚¬ СѓРєР°Р·Р°С‚РµР»в‚¬ РІ РїР°Рјв‚¬С‚Рё РєР°РґСЂР° РїСЂРё С‡С‚РµРЅРёРё Р·Р°РїРёСЃРё.
void SSD1306_SetColumns(uint8_t Start, uint8_t End);
// С•СЂРѕС†РµРґСѓСЂР° СѓСЃС‚Р°РЅР°РІР»РёРІР°РµС‚ РЅР°С‡Р°Р»СЊРЅС‹Р№ Рё РєРѕРЅРµС‡РЅС‹Р№ РёРЅРґРµРєСЃ СЃС‚СЂР°РЅРёС†С‹
// РґР»в‚¬ Р°РІС‚РѕСЃРјРµС‰РµРЅРёв‚¬ СѓРєР°Р·Р°С‚РµР»в‚¬ РІ РїР°Рјв‚¬С‚Рё РєР°РґСЂР° РїСЂРё С‡С‚РµРЅРёРё Р·Р°РїРёСЃРё.
void SSD1306_SetPages(uint8_t Start, uint8_t End);
// С•СЂРѕС†РµРґСѓСЂР° РїРµСЂРµРґР°Р„С‚ РІ РґРёСЃРїР»РµР№ Р±СѓС„РµСЂ РєР°РґСЂР° РёР· РјР°СЃСЃРёРІР° pBuff
void SSD1306_DisplayFullUpdate(uint8_t *pBuff, uint16_t BuffLen);

#endif
