//--------------------------------------------------------------
// File     : stm32_ub_led.h
//--------------------------------------------------------------

//--------------------------------------------------------------
#ifndef __STM32F10_UB_LED_H
#define __STM32F10_UB_LED_H

//--------------------------------------------------------------
// Includes
//--------------------------------------------------------------
#include "stm32f10x.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_rcc.h"




//--------------------------------------------------------------
// Р РЋР С—Р С‘РЎРѓР С•Р С” Р Р†РЎРѓР ВµРЎвЂ¦ РЎРѓР Р†Р ВµРЎвЂљР С•Р Т‘Р С‘Р С•Р Т‘Р С•Р Р†
// Р СњР С•Р С�Р ВµРЎР‚Р В° Р Р…Р Вµ Р Т‘РЎС“Р В±Р В»Р С‘РЎР‚РЎС“РЎР‹РЎвЂљРЎРѓРЎРЏ, Р Р…Р В°РЎвЂЎР С‘Р Р…Р В°РЎР‹РЎвЂљРЎРѓРЎРЏ РЎРѓ 0
//--------------------------------------------------------------
typedef enum 
{
  LED_DEBUG = 0,  // LED4 Р Р…Р В° STM32F4-Discovery
  LED_RED = 1,  // LED4 Р Р…Р В° STM32F4-Discovery
  LED_BLUE = 2,  // LED4 Р Р…Р В° STM32F4-Discovery
  LED_GREEN = 3  // LED4 Р Р…Р В° STM32F4-Discovery
}LED_NAME_t;

#define  LED_ANZ  1 // Р С™Р С•Р В»Р С‘РЎвЂЎР ВµРЎРѓРЎвЂљР Р†Р С• LED_NAME_t


//--------------------------------------------------------------
// Р пїЅР Р…Р Т‘Р С‘Р С”Р В°РЎвЂљР С•РЎР‚ РЎРѓР С•РЎРѓРЎвЂљР С•РЎРЏР Р…Р С‘РЎРЏ РЎРѓР Р†Р ВµРЎвЂљР С•Р Т‘Р С‘Р С•Р Т‘Р С•Р Р†
//--------------------------------------------------------------
typedef enum {
  LED_OFF = 0,  // Р РЋР Р†Р ВµРЎвЂљР С•Р Т‘Р С‘Р С•Р Т‘ Р Р†РЎвЂ№Р С”Р В»РЎР‹РЎвЂЎР ВµР Р…
  LED_ON         // Р РЋР Р†Р ВµРЎвЂљР С•Р Т‘Р С‘Р С•Р Т‘ Р Р†Р С”Р В»РЎР‹РЎвЂЎР ВµР Р…
}LED_STATUS_t;


//--------------------------------------------------------------
// Р РЋРЎвЂљРЎР‚РЎС“Р С”РЎвЂљРЎС“РЎР‚Р В° Р С‘Р Р…Р С‘РЎвЂ Р С‘Р В°Р В»Р С‘Р В·Р В°РЎвЂ Р С‘Р С‘ РЎРѓР Р†Р ВµРЎвЂљР С•Р Т‘Р С‘Р С•Р Т‘Р В°
//--------------------------------------------------------------
typedef struct {
  LED_NAME_t LED_NAME;    // Name
  GPIO_TypeDef* LED_PORT; // Port
  const uint16_t LED_PIN; // Pin
  const uint32_t LED_CLK; // Clock
  LED_STATUS_t LED_INIT;  // Init
}LED_t;


//--------------------------------------------------------------
// Р вЂњР В»Р С•Р В±Р В°Р В»РЎРЉР Р…РЎвЂ№Р Вµ РЎвЂћРЎС“Р Р…Р С”РЎвЂ Р С‘Р С‘
//--------------------------------------------------------------
void UB_Led_Init(void);
void UB_Led_Off(LED_NAME_t led_name);
void UB_Led_On(LED_NAME_t led_name);
void UB_Led_Toggle(LED_NAME_t led_name);
void UB_Led_Switch(LED_NAME_t led_name, LED_STATUS_t wert);



//--------------------------------------------------------------
#endif // __STM32F4_UB_LED_H
